Repository: 84000/data-translation-memory
Catalog: toh1-1-v1.tmx
Source language: bo
Languages: en

source: གལ་ཏེ་དེ་ལྟ་ན་ཁྱོད་ཉིད་ཤེས་སོ། །བྲམ་ཟེ་དེས་དེ་དཔལ་གྱི་འབྱོར་པ་ཆེན་པོས་བག་མར་བླངས་སོ། །
en: ‘I will give a large dowry and take her as my bride,’ said the brahmin.

source: ཞིབ་མ་མོས་སྨྲས་པ་མིང་པོ་ཚུར་ཤོག་དང་ལྷན་ཅིག་འཁོད་དོ། །
en: ‘Brother, let us leave,’ said Sūkṣmā, and together they stepped away.

source: དེས་སྨྲས་པ། ཁོ་བོ་ནི་འདོད་པ་དག་དོན་དུ་མི་གཉེར་བས་ཁོ་བོ་དགོན་པར་འགྲོའོ། །
en: “Śūrpī said, ‘It is because I do not pursue desires that I have gone to remote places.’

source: མིང་པོ་གལ་ཏེ་དེ་ལྟ་ན་ཇི་སྟེ་ཁྱོད་ཀྱིས་ཡོན་ཏན་གྱི་ཚོགས་ཆུང་ཟད་ཐོབ་ན་བདག་ལ་རྗོད་ཅིག །
en: ‘Then, brother, should you attain even the slightest store of qualities, you must come share them with me.’

source: ཞིབ་མ་མཐའ་གཅིག་ཏུ་སོང་སྟེ་མཁན་པོ་མེད་པ་དང་སློབ་དཔོན་མེད་པར་
en: Śūrpī went off into the wilds and, without a teacher or a guide,

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་མཐུན་པའི་ཆོས་སུམ་བཅུ་རྩ་བདུན་བསྐྱེད་ནས་རང་བྱང་ཆུབ་མངོན་སུམ་དུ་བྱས་སོ། །
en: gave rise to the thirty-seven qualities conducive to awakening and actualized his own awakening.

source: བདག་གིས་སྲིང་མོ་དེ་ལ་ཁས་བླངས་པས་སོང་སྟེ་ཉེ་བར་བསྟན་པར་བྱའོ་སྙམ་མོ། །
en: ‘I promised to share any such attainment with my sister, so I must do so.’

source: བདག་ཉིད་ཆེན་པོ་དེ་དག་ནི་ལུས་ཀྱིས་ཆོས་སྟོན་གྱི་ཚིག་གིས་མི་སྟོན་པས་
en: “Great persons teach the Dharma through their actions and not their words.

source: དེ་དེ་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་དེས་ངང་པའི་རྒྱལ་པོ་འདབ་མ་བརྐྱང་བ་ལྟར་སྟེང་
en: So, out of the great love and compassion Śūrpī felt, like a swan spreading its wings,

source: གི་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ནས་འབར་བ་དང་། གསལ་བ་དང་། ཆར་འབེབས་པ་དང་། གློག་འབྱིན་པའི་ཆོ་འཕྲུལ་དག་བྱ་བར་བརྩམས་སོ། །
en: he flew up into the sky above and began to miraculously invoke flashes and bursts of light, clouds and lightning.

source: སོ་སོའི་སྐྱེ་བོ་ནི་རྫུ་འཕྲུལ་ལ་མྱུར་དུ་སེམས་གཏོད་པར་བྱེད་པ་ཡིན་པས་ཞིབ་མ་མོས་
en: Now, because ordinary beings are swift to pay heed to miracles,

source: ཤིང་ལྗོན་པ་རྩ་བ་ནས་བཅད་པ་བཞིན་དུ་རང་སངས་རྒྱས་དེའི་རྐང་པ་གཉིས་ལ་གཏུགས་ནས་སྨྲས་པ།
en: Sūkṣmā dropped like a felled tree at the pratyekabuddha’s feet and said,

source: འཕགས་པ་ཁྱོད་ཀྱིས་ཡོན་ཏན་གྱི་ཚོགས་འདི་ལྟ་བུ་བརྙེས་སམ། ཐོབ་བོ། །
en: ‘Noble one! Have you found such a store of qualities?’ “ ‘I have.’

source: འཕགས་པ་ཁྱོད་ནི་བསོད་སྙོམས་བཞེས་པ་ལགས་ལ།
en: ‘Noble one, accept these alms.

source: བདག་ནི་བསོད་ནམས་འཚལ་བ་ལགས་པས་འདི་ཉིད་དུ་བཞུགས་ཤིག་དང་། བདག་གིས་ཁྱོད་ལ་བསོད་སྙོམས་ཀྱི་མཁོ་བ་བསྟབ་པར་བགྱིའོ། །
en: I seek merit, so please stay here and let me provide you all the provisions you need.’

source: སྲིང་མོ་ཇེ་ཁྱིམ་ཐབ་ལ་དྲིས་ཤིག །དེ་ཁྱིམ་ཐབ་ཀྱི་གན་དུ་སོང་སྟེ་སྨྲས་པ།
en: Sister, first ask the master of the house.’ “She went to the brahmin, the master of the house, and said

source: རྗེའི་སྲས་བདག་གི་མིང་པོ་རབ་ཏུ་བྱུང་བ་བརྟུལ་ཞུགས་གྲུབ་པ་བདག་ཉིད་ཆེན་པོར་གྱུར་གྱིས་
en: ‘Son of a lord, my brother has gone forth, accomplished his vow, and become a great being.

source: གནང་བར་མཛོད་ཅིག་དང་། བདག་གིས་དེ་ལ་བསོད་སྙོམས་ཀྱི་མཁོ་བ་བསྟབ་པར་བགྱིའོ། །
en: Please allow him to stay and I will offer him all the provisions he needs.’

source: དེས་སྨྲས་པ། གལ་ཏེ་རབ་ཏུ་མ་བྱུང་ན་ཡང་མི་འདོད་བཞིན་དུ་སྦྱིན་པར་བྱ་བ་ཡིན་ན།
en: “Her husband replied, ‘If I give to laymen without being asked,

source: རབ་ཏུ་བྱུང་བ་བརྟུལ་ཞུགས་གྲུབ་པ་བདག་ཉིད་ཆེན་པོར་གྱུར་ན་ལྟ་སྨོས་ཀྱང་ཅི་
en: why would I not give to a renunciant who has lived up to his vows and become a saint?

source: དགོས་ཀྱིས་སོང་ལ་ཅི་བདེར་བསོད་སྙོམས་ཀྱི་མཁོ་བ་སྟོབས་ཤིག །
en: Go, do as you please and offer him all the provisions he needs.’

source: དེས་རང་སངས་རྒྱས་དེ་ལ་ཟླ་བ་གསུམ་དུ་བསོད་སྙོམས་ཀྱི་མཁོ་བ་བསྟབས་ནས་
en: “After three months, during which she offered the pratyekabuddha all the provisions he needed,

source: རས་ཡུག་ཆེན་ཆེན་པོ་ལ་འོས་པ་བསྐོན་ཏེ་ཁབ་དང་། གྲི་དང་། སྐུད་པ་ཡང་ཕུལ་ལོ། །
en: she offered him a piece of cotton cloth large enough to be worn as a robe, a needle, a razor, and thread.

source: དེས་རས་ཡུག་ཆེན་དང་། གྲི་དང་། ཁབ་དང་། སྐུད་པ་དེ་བླངས་ཏེ།
en: He accepted the cotton cloth, needle, razor, and thread, and began to cut the cloth in front of her.

source: དེ་ཉིད་ཀྱི་མདུན་དུ་དྲ་བར་བརྩམས་པ་དང་གྲི་དེ་རྣོ་བ་རྣོ་བར་གཅོད་ནས་
en: As he sharpened the razor’s blade,

source: ཞིབ་མ་མོས་དེའི་རྐང་པ་གཉིས་ལ་ཕྱག་འཚལ་ཏེ་སྨོན་ལམ་འདི་སྐད་ཅེས།
en: Sūkṣmā prostrated at his feet and said this prayer:

source: ཇི་ལྟར་གྲི་འདི་རྣོ་བ་རྣོ་བར་གཅོད་པ་དེ་ལྟར་བདག་ཀྱང་
en: ‘Just as this razor’s blade becomes sharper and sharper,

source: དགེ་བའི་རྩ་བ་འདིས་ཤེས་རབ་རྣོ་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ། །
en: may these roots of virtue sharpen my intellect.’

source: རང་སངས་རྒྱས་དེས་ཁབ་ཀྱིས་དབུག་པར་བརྩམས་པ་དང་ཁབ་དེ་ཟབ་མོ་ཟབ་མོར་འབིགས་ནས་
en: “The pratyekabuddha began to poke holes with the needle and as the needle made finer and finer holes,

source: ཇི་ལྟར་ཁབ་འདི་ཟབ་མོ་ཟབ་མོར་འབིགས་པ་དེ་ལྟར་བདག་ཀྱང་
en: ‘Just as this needle pokes finer and finer holes,

source: དགེ་བའི་རྩ་བ་འདིས་ཤེས་རབ་ཟབ་མོར་གྱུར་ཅིག་ཅེས་བཏབ་བོ། །
en: may these roots of virtue refine my intellect.’

source: རང་སངས་རྒྱས་དེས་སྐུད་པས་དྲུབ་པར་བརྩམས་པ་དང་སྐུད་པ་དེ་ཐལ་བྱུང་ཐལ་བྱུང་དུ་འགྲོ་ནས་
en: “The pratyekabuddha began to sew with the thread and as the thread passed through the cloth unhindered,

source: ཇི་ལྟར་སྐུད་པ་འདི་ཐལ་བྱུང་ཐལ་བྱུང་དུ་འགྲོ་བ་དེ་ལྟར་བདག་ཀྱང་
en: ‘Just as this thread passes unhindered through cloth,

source: དགེ་བའི་རྩ་བ་འདིས་ངེས་པར་འབྱེད་པའི་ཤེས་རབ་ཅན་དུ་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: may these roots of virtue help me develop an incisive intellect.’

source: དགེ་སློང་དག་དེ་ལ་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་བུ་མོ་ཞིབ་མ་མོ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་ཤཱ་རིའི་བུ་འདི་ཉིད་ཡིན་ཏེ།
en: “Monks, at that time the monk Śāriputra was the brahmin’s daughter Sūkṣmā.

source: དེས་རང་སངས་རྒྱས་ལ་མཆོད་པ་བྱས་ནས་སྨོན་ལམ་བཏབ་པ་གང་ཡིན་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ད་ལྟར་ཤེས་རབ་རྣོ་བ་དང་། ཤེས་རབ་ཟབ་པ་དང་། ངེས་པར་འབྱེད་པའི་ཤེས་རབ་ཅན་དུ་གྱུར་ཏོ། །
en: That action of making offerings and prayers to the pratyekabuddha ripened so that now his intellect is sharp, fine, and incisive.

source: དགེ་སློང་དག་དེ་ལྟར་ན་ལས་གཅིག་ཏུ་གནག་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་གཅིག་ཏུ་གནག་པ་ཡིན་ལ།
en: “Monks, the ripened fruits of wholly negative actions are wholly negative,

source: ལས་འདྲེན་མ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡང་འདྲེན་མ་ཡིན་ནོ། །
en: and the ripened fruits of mixed actions are mixed,

source: ལས་གཅིག་ཏུ་དཀར་བ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡང་གཅིག་ཏུ་དཀར་བ་ཡིན།
en: but the ripened fruits of wholly positive actions are wholly positive.

source: དགེ་སློང་དག་དེ་ལྟ་བས་ན་ལས་གཅིག་ཏུ་གནག་པ་རྣམས་དང་འདྲེན་མ་རྣམས་སྤངས་ཏེ།
en: “Monks, therefore abandon wholly negative and mixed actions

source: ལས་གཅིག་ཏུ་དཀར་བ་རྣམས་ལ་བརྩལ་བར་བྱ་སྟེ། དགེ་སློང་དག་ཁྱེད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ། །
en: and seek wholly positive actions. Monks, this is how you should train.”

source: ཡང་དགེ་སློང་རྣམས་ཐེ་ཙོམ་སྐྱེས་ནས་ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: Still in doubt, the monks questioned him who severs all doubts, the Blessed Buddha,

source: བཙུན་པ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ལས་ཅི་ཞིག་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཁྱིམ་ཧ་ཅང་ཕྱུག་པར་ཡང་མ་སྐྱེས། ཁྱིམ་ཧ་ཅང་དབུལ་བར་ཡང་མ་སྐྱེས།
en: “Reverend, what has the venerable Śāriputra done that the ripened fruit of his action has led to his birth into a family that is neither extremely rich nor extremely poor,

source: ཁྱིམ་འབྲིང་པོར་སྐྱེས་ཤིང་རབ་ཏུ་འབྱུང་བ་མང་བར་གྱུར།
en: but into a family of moderate means with many renunciants?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied,

source: དགེ་སློང་དག་ཤཱ་རིའི་བུ་ཉིད་ཀྱིས་ལས་ཚོགས་རྙེད་པ། རྐྱེན་ཡོངས་སུ་བསྒྱུར་བ།
en: “Monks, Śāriputra himself discovered the store of action, mastered conditions,

source: ཤཱ་རིའི་བུ་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་བསགས་པ་དག་གཞན་སུ་ཞིག་གིས་མྱོང་བར་འགྱུར།
en: and so no one else experiences Śāriputra’s actions and accumulations for themselves.

source: འདི་ལྟར་ལས་དགེ་བ་དང་མི་དགེ་བ་བྱས་ཤིང་བསགས་པ་དག་ནི་ཟིན་པའི་ཕུང་པོ་དང་
en: Virtuous and non-virtuous actions performed and accumulated come to ripen upon the aggregates,

source: ཁམས་དང་སྐྱེ་མཆེད་དག་ལ་རྣམ་པར་སྨིན་པར་འགྱུར་ཏེ།
en: elements, and seats of the senses of the one who performed them:

source: ལས་རྣམས་བསྐལ་པ་བརྒྱར་ཡང་ནི། །ཆུད་མི་ཟ་བའང་ཚོགས་དང་དུས། །
en: “Actions never waste away, Not even after one hundred eons.

source: རྙེད་ན་ལུས་ཅན་རྣམས་ལ་ནི། །འབྲས་བུ་དག་ཏུ་འགྱུར་བ་ཉིད། །
en: When the time and the conditions Are right, they alight upon embodied beings.

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་རི་བྲགས་ཤིག་ན་རྒྱལ་པོ་ཞིག་འདུག་པ་དེས་རིགས་མཉམ་པ་ལས་ཆུང་མ་བླངས་ནས།
en: “Monks, long ago a king who lived in a remote mountain range took a wife of equal caste

source: རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་
en: From their sporting, lovemaking, and the indulging all of their desires,

source: དེའི་བུ་བྱུང་ནས་བསྲིངས་ཤིང་བསྐྱེད་དེ་ཆེན་པོར་གྱུར་ཏོ། །
en: there came a boy, whom they nurtured and raised until he grew into a man.

source: དེས་ཕ་ཆོས་དང་ཆོས་མ་ཡིན་པས་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་པ་མཐོང་ནས་དེས་བསམས་པ།
en: Seeing that his father ruled in ways compatible with the principles of justice, the boy thought,

source: བདག་ཀྱང་ཡབ་འདས་ནས་རྒྱལ་པོར་འགྱུར་ལ།
en: ‘When my father passes, I will become king.

source: བདག་གིས་ཀྱང་ཆོས་དང་ཆོས་མ་ཡིན་པས་རྒྱལ་སྲིད་བྱེད་དུ་བཅུག་ན་སེམས་ཅན་དམྱལ་བར་འགྲོ་བར་འགྱུར་རོ་སྙམ་ནས།
en: If I exercise my royal authority in ways compatible with the principles of justice, in a later life I will go to hell.’

source: དེ་རྒྱལ་པོའི་གན་དུ་སོང་སྟེ་ཕྱིན་ནས་སྨྲས་པ།
en: “He went to the king and said,

source: ཡབ་གནང་བར་མཛོད་ཅིག་དང་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་ངོ་། །
en: ‘Father, grant me leave. I wish to go forth in the well-proclaimed Dharma and Vinaya.’

source: རྒྱལ་པོས་སྨྲས་པ།
en: “The king replied,

source: བུ་གང་གི་དོན་དུ་མཆོད་སྦྱིན་སྦྱིན་པར་བྱེད། སྦྱིན་སྲེག་སྲེག་པར་བྱེད། དཀའ་ཐུབ་ཀྱིས་གདུང་བར་བྱེད་པའི་རྒྱལ་སྲིད་དེ་ཁྱོད་ཀྱི་ལག་མཐིལ་དུ་འོངས་ཤིང་
en: ‘Son, the royal authority, for which you have made offerings to the gods, performed fire pūja, and suffered through austerities, is within reach.

source: གླང་པོ་ཆེས་འགྲོ་བའི་རིགས་སུ་སྐྱེས་ན་ཅིའི་ཕྱིར་རབ་ཏུ་འབྱུང་ཞེས་སྤྱོས་ཏེ་དེ་ཕས་རབ་ཏུ་འབྱུང་བར་མ་སྟེར་ཏོ། །
en: Having been born into a caste borne about by elephants, why would you renounce it?’ “And with that his father refused to let him go forth.

source: དེ་དུས་གཞན་ཞིག་ན་གླང་པོ་ཆེའི་གཤུལ་དུ་ཞོན་ཏེ་ཕྱིར་བྱུང་བ་དང་།
en: “Some time later, the boy set out, riding astride the neck of an elephant,

source: དེས་མི་དབུལ་པོ་ཞིག་ཁར་བ་དང་སློང་ཕོར་ཆག་པ་ཐོགས་ཏེ་སློང་མོ་ལ་རྒྱུ་བ་མཐོང་ངོ་། །
en: when he saw a poor man on his begging rounds holding a staff and a broken beggar’s bowl.

source: མཐོང་ནས་ཀྱང་རྒྱལ་བུ་དེ་དེའི་གན་དུ་སོང་སྟེ་སྨྲས་པ།
en: The prince went to him and said,

source: ཀྭའེ་ནང་རྗེ་ཁོ་བོ་ནི་འདི་ལྟ་བུའི་ཁྱིམ་དུ་སྐྱེས་པ་དེས་རབ་ཏུ་འབྱུང་བ་མ་ཐོབ་ན་
en: ‘Householder, because I was born into a wealthy family, I could not get consent to go forth.

source: ཁྱོད་ཅིའི་ཕྱིར་རབ་ཏུ་མི་འབྱུང་།
en: You are poor, so why have you not joined such an order?’

source: དེས་སྨྲས་པ། རྒྱལ་པོའི་སྲས་བདག་ལ་ལྷུང་བཟེད་མ་མཆིས་ཤིང་ཆོས་གོས་མ་མཆིས་ན་ཇི་ལྟར་རབ་ཏུ་འབྱུང་བར་བགྱི།
en: ‘Prince,’ he replied, ‘how could I go forth if I don’t have a begging bowl or a dharma robe?’“

source: རྒྱལ་བུས་སྨྲས་པ། བཞིན་བཟངས་ཚུར་ཤོག་ངས་ཁྱོད་ལ་ལྷུང་བཟེད་དང་ཆོས་གོས་སྦྱིན་པར་བྱའོ་ཞེས་རྒྱལ་བུ་དེས་དེ་ཁྲིད་དེ་སོང་ནས་
en: ‘Good man, come,’ said the prince. ‘I will give you a begging bowl and a Dharma robe.’“

source: བསྟི་གནས་ཤིག་ན་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་ཞིག་འདུག་པ་དེའི་གན་དུ་སོང་སྟེ་
en: “The prince then took him to the sanctuary of a sage endowed with the five types of heightened awareness.

source: ཕྱིན་ནས་གླང་པོ་ཆེའི་གཤུལ་ནས་བབས་ཏེ་དུལ་བ་དང་བཅས་པས་སྨྲས་པ།
en: The prince got down from his perch atop the elephant’s neck and said calmly,

source: ཤེས་ལྡན་རིགས་ཀྱི་བུ་འདི་ཁྱོད་ལས་རབ་ཏུ་འབྱུང་བར་འདོད་ཀྱིས།
en: ‘Sir , this noble son wishes to go forth.

source: འདི་རབ་ཏུ་ཕྱུང་ཤིག་དང་བདག་གིས་འདི་ལ་ལྷུང་བཟེད་དང་ཆོས་གོས་སྦྱིན་པར་བྱའོ། །
en: Allow him to do so, and I shall provide his begging bowl and Dharma robe.’“

source: དྲང་སྲོང་དེས་དེ་རབ་ཏུ་ཕྱུང་ངོ་། །
en: “So the sage allowed the beggar to go forth.

source: རྒྱལ་བུ་དེས་དེའི་ལྷུང་བཟེད་དང་ཆོས་གོས་དག་བཀྲུས་ཤིང་དྲུབས་ཏེ་
en: The prince then washed a begging bowl and had a Dharma robe cut, sewn, and dyed.

source: ཁ་བསྒྱུར་ནས་བྱིན་ཏེ་སྨྲས་པ།
en: He handed them over to the former beggar and said,

source: འཕགས་པ་གལ་ཏེ་ཁྱོད་ཀྱིས་ཡོན་ཏན་གྱི་ཚོགས་ཅུང་ཟད་ཐོབ་ན་བདག་ལ་རྗོད་ཅིག །
en: ‘Noble one, should you attain even the slightest store of qualities, you must tell me.’

source: དེས་རྒྱལ་བུ་དེ་ལ་དེ་ལྟར་བྱའོ་ཞེས་ཁས་བླངས་སོ། །
en: “He promised the prince he would do so and went off into the wilds.

source: དེ་ཕྱོགས་གཅིག་ཏུ་སོང་སྟེ་མཁན་པོ་མེད་པ་དང་སློབ་དཔོན་མེད་པར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་མཐུན་པའི་ཆོས་སུམ་བཅུ་རྩ་བདུན་བསྐྱེད་ནས་རང་བྱང་ཆུབ་མངོན་ སུམ་དུ་བྱས་སོ། །
en: Without a teacher or a guide, he gave rise to the thirty-seven qualities conducive to awakening and actualized his own awakening.

source: བདག་གིས་ཡོན་ཏན་གྱི་ཚོགས་གང་ཅུང་ཟད་ཐོབ་པ་གང་ཡིན་པ་དེ་ཐམས་ཅད་རྒྱལ་པོའི་བུ་དེ་ལ་བརྟེན་ནས་ཐོབ་པ་ཡིན་ལ།
en: ‘This small store of qualities I have attained, I have attained with the help of the prince.

source: བདག་གིས་དེ་ལ་ཁས་བླངས་པས་སོང་ལ་དེ་ལ་ཉེ་བར་བསྟན་པར་བྱའོ་སྙམ་མོ། །
en: I promised to share any such attainment with him, so I must do so.’

source: བདག་ཉིད་ཆེན་པོ་དེ་དག་ནི་ལུས་ཀྱིས་ཆོས་སྟོན་གྱི། ཚིག་གིས་མི་སྟོན་པས་
en: “Great persons teach the Dharma through their actions and not their words.

source: དེ་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་དེས་ངང་པའི་རྒྱལ་པོ་འདབ་མ་བརྐྱང་བ་ལྟར་སྟེང་གི་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ནས་
en: So out of the great love and compassion he felt, like a swan spreading its wings, he flew up into the sky above

source: འབར་བ་དང་། གསལ་བ་དང་། ཆར་འབེབས་པ་དང་། གློག་འབྱིན་པའི་ཆོ་འཕྲུལ་དག་བྱ་བར་བརྩམས་སོ། །
en: and miraculously invoked flashes and bursts of light, clouds and lightning.

source: སོ་སོའི་སྐྱེ་བོ་ནི་རྫུ་འཕྲུལ་ལ་མྱུར་དུ་སེམས་གཏོད་པར་བྱེད་པ་ཡིན་པས།
en: Now, because ordinary beings are swift to pay heed to miracles,

source: རྒྱལ་བུ་དེ་ཤིང་ལྗོན་པ་རྩ་བ་ནས་བཅད་པ་བཞིན་དུ་རང་སངས་རྒྱས་དེའི་རྐང་པ་གཉིས་ལ་གཏུགས་ནས་སྨྲས་པ།
en: the prince dropped like a felled tree at the pratyekabuddha’s feet and said,

source: འཕགས་པ་ཁྱོད་ཀྱི་ཡོན་ཏན་གྱི་ཚོགས་འདི་ལྟ་བུ་བརྙེས་སམ།
en: ‘Noble one! Have you found such a store of qualities?’

source: ཐོབ་བོ། །དེས་བསམས་པ། འཕགས་པ་འདིས་ཡོན་ཏན་གྱི་ཚོགས་གང་ཅུང་ཟད་ཐོབ་པ་གང་ཡིན་པ་དེ་
en: ‘I have.’ “The prince thought, ‘If the small store of qualities this noble being has attained,

source: ཐམས་ཅད་བདག་ལ་བརྟེན་ནས་ཐོབ་པ་ཡིན་ན། འཕགས་པ་འདིས་སྔོན་རབ་ཏུ་འབྱུང་བ་མ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཁྱིམ་དེ་ལྟ་བུར་སྐྱེས་པ་ཡིན་ལ།
en: he has attained with my help, then this noble being’s failure to get consent to go forth was due to his birth into a lowly family like his.

source: བདག་གིས་རབ་ཏུ་འབྱུང་བ་མ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཁྱིམ་འདི་ལྟ་བུར་སྐྱེས་པ་ཡིན་ནོ་སྙམ་ནས།
en: My own failure to get consent to go forth was due to my birth into a high family such as mine.’

source: དེས་རང་སངས་རྒྱས་དེའི་རྐང་པ་གཉིས་ལ་ཕྱག་འཚལ་ཏེ་སྨོན་ལམ་འདི་སྐད་ཅེས།
en: “With that thought, he prostrated at the pratyekabuddha’s feet and made this prayer:

source: དགེ་བའི་རྩ་བ་འདི་ཡིས་བདག །ཧ་ཅང་ཕྱུག་པའི་ཁྱིམ་དང་ནི། །དབུལ་བོའི་ཁྱིམ་དུ་མི་སྐྱེ་བར། །བར་མའི་ཁྱིམ་དུ་སྐྱེ་འགྱུར་ཞིང་། །རྟག་པར་རབ་འབྱུང་མང་བར་ཤོག །ཅེས་བཏབ་བོ། །
en: ‘By these roots of virtue, May I be born, not in a wealthy house Nor in one that is poor; Let it be rather in a house of moderate means And always among many renunciants.’

source: དགེ་སློང་དག་དེ་ལ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་དེ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་ཤཱ་རིའི་བུ་འདི་ཉིད་ཡིན་ཏེ།
en: “Monks, the monk Śāriputra was at that time the prince.

source: དེས་རང་སངས་རྒྱས་ལ་མཆོད་པ་བྱས་ནས་སྨོན་ལམ་བཏབ་པ་གང་ཡིན་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་
en: That action of making offerings and prayers to the pratyekabuddha ripened

source: ད་ལྟར་ཁྱིམ་ཧ་ཅང་ཕྱུག་པར་ཡང་མ་སྐྱེས།
en: so that now he was not born into too rich a family, nor into too poor a family,

source: ཁྱིམ་ཧ་ཅང་དབུལ་བར་ཡང་མ་སྐྱེས་པར་ཁྱིམ་འབྲིང་པོར་སྐྱེས་ཤིང་རབ་ཏུ་འབྱུང་བ་མང་བར་གྱུར་ཏོ། །
en: but rather into a family of moderate means in which there were many renunciants.

source: དགེ་སློང་དག་དེ་ལྟར་ན་ལས་གཅིག་ཏུ་གནག་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་གཅིག་ཏུ་གནག་པ་ཡིན་ལ། ལས་གཅིག་ཏུ་ དཀར་བ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡང་གཅིག་ཏུ་དཀར་བ་ཡིན།
en: “Monks, thus the ripened fruits of wholly negative actions are wholly negative while the ripened fruits of wholly positive actions are wholly positive

source: དགེ་སློང་དག་དེ་ལྟ་བས་ན་ལས་གཅིག་ཏུ་གནག་པ་རྣམས་དང་འདྲེན་མ་རྣམས་སྤངས་ཏེ། ལས་གཅིག་ཏུ་དཀར་བ་རྣམས་ལ་བརྩལ་བར་བྱ་སྟེ།
en: “Monks, therefore abandon wholly negative and mixed actions and seek wholly positive actions.

source: དགེ་སློང་དག་ཁྱེད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ།
en: Monks, this is how you should train.”

source: དགེ་སློང་དག་ཁྱེད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ། །
en: Monks, this is how you should train.”

source: བཙུན་པ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ལས་ཅི་ཞིག་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་བཅོམ་ལྡན་འདས་ཀྱིས་ཤེས་རབ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་དང་། སྤོབས་པ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན།
en: “Reverend, what has the venerable Śāriputra done that the ripened fruit of his action has led him to be singled out by the Blessed One as the wisest of the wise and the most confident of the confident?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་ནི་སྨོན་ལམ་གྱི་དབང་གིས་ཏེ།
en: The Blessed One replied, “It is the prayers he made.

source: གང་དུ་སྨོན་ལམ་བཏབ་ཅེ་ན།
en: What did he pray for?

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་
en: Monks, long ago during this fortunate eon, when the lifespan of beings was twenty thousand years,

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: the blessed Buddha Kāśyapa appeared in the world,

source: སྟོན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ།
en: a teacher, a tathāgata, an arhat, a perfectly awakened buddha, a knowledgeable and venerable one, a sugata,

source: འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: one who knew the world, an unsurpassed guide who tamed beings, a teacher to gods and men,

source: དེ་བཱ་རཱ་ཎ་སཱི་ན་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་ན་ཉེ་བར་རྟེན་ཅིང་བཞུགས་སོ།
en: who lived and dwelt in the Ṛṣipatana Deer Park near Vārāṇasī.

source: དེའི་བསྟན་པ་ལ་འདི་རབ་ཏུ་བྱུང་ནས་དགེ་སློང་གང་གིས་དེ་རབ་ཏུ་ཕྱུང་བའི་དགེ་སློང་དེ་
en: “A monk, he who would later become Śāriputra, went forth into Kāśyapa’s teachings

source: དེ་བཞིན་གཤེགས་པ་དགྲ་ བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་ཤེས་རབ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་དང་སྤོབས་པ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ།
en: and was singled out by the tathāgata, the arhat, the perfectly awakened Buddha Kāśyapa as the wisest of the wise and the most confident of the confident.

source: དེ་ན་འདིས་ཚེ་ཇི་སྲིད་པར་ཚངས་པར་སྤྱོད་པ་སྤྱད་ན་ཡོན་ཏན་གྱི་ཚོགས་འགའ་ཡང་མ་ཐོབ་ནས། །
en: “He lived the holy life for the rest of his days, but he did not attain any store of qualities.

source: དེའི་འོག་ཏུ་འཆི་བའི་ཚེ་སྨོན་ལམ་འདི་སྐད་ཅེས། །
en: Later, as he was dying, he made this prayer:

source: བདག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་གནས་བླ་ན་མེད་པ་འོད་སྲུང་ལ་ཚེ་ཇི་སྲིད་པར་ཚངས་པར་སྤྱོད་པ་སྤྱད་ན་
en: ‘Although I have spent my entire life living the holy life under Kāśyapa, an arhat, a blessed tathāgata, a perfectly awakened buddha and unsurpassed object of veneration,

source: ཡོན་ཏན་གྱི་ཚོགས་འགའ་ཡང་མ་ཐོབ་སྟེ།
en: I have not attained any store of qualities.

source: བདག་གིས་ཚེ་ཇི་སྲིད་པར་ཚངས་པར་སྤྱོད་པ་སྤྱད་པའི་དགེ་བའི་རྩ་བ་འདིས་
en: May the roots of virtue, accumulated through living the holy life for my entire lifetime,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལ།
en: arhat and blessed tathāgata and perfectly awakened Buddha Kāśyapa has prophesied to the young brahmin Uttara, saying,

source: བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་ན་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཐུབ་པ་ན་
en: ‘Young brahmin, in the future, when the lifespan of beings is one hundred years,

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་
en: you will become the tathāgata, the arhat, the perfectly awakened Buddha,

source: རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ།
en: the knowledgeable and venerable one,

source: འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ།
en: the sugata, the one who knows the world, the unsurpassed guide who tames beings,

source: ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་
en: the teacher to gods and men known as the Blessed Buddha Śākyamuni,’

source: ལུང་བསྟན་པ་དེའི་བསྟན་པ་ལ་བདག་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱེད་ཅིང་།
en: nd that I may go on to abandon all disturbing emotions and actualize arhatship.

source: ཇི་ལྟར་མཁན་པོ་འདི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་
en: And just as I, this master, was singled out by the tathāgata, the arhat, and perfectly awakened Buddha Kāśyapa

source: ཤེས་རབ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་དང་། སྤོབས་པ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་
en: as the wisest of the wise and the most confident of the confident,

source: དེ་བཞིན་དུ། བདག་ཀྱང་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ། ཤཱཀྱའི་སེང་གེ།
en: may I too be singled out by the blessed sage of the Śākyas, lion of the Śākyas,

source: ཤཱཀྱའི་རྒྱལ་པོ་གཙོ་བོ་དེས་
en: king of the Śākyas,

source: ཤེས་རབ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་དང་། སྤོབས་པ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པར་གྱུར་ཅིག་ཅེས་
en: as the wisest of the wise and the most confident of the confident.’“

source: གདབ་པར་བརྩམས་པས་སྨོན་ལམ་དེའི་དབང་གིས་ད་ལྟར་དེ་བཞིན་གཤེགས་པས་
en: “Because of that prayer, Śāriputra has now been singled out by the Tathāgata

source: ཤེས་རབ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་དང་། སྤོབས་པ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ།
en: as the wisest of the wise and the most confident of the confident.”

source: བཙུན་པ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་ལས་ཇི་ཞིག་བགྱིས་ན་
en: “Reverend, what has the venerable, the great Maudgalyāyana done

source: ལས་དེའི་རྣམ་པར་སྨིན་པས་རྫུ་འཕྲུལ་ཆེ་བ་དང་མཐུ་ཆེ་བར་གྱུར།
en: that the ripened fruit of his action has led to him being the most powerful and the greatest miracle worker?”

source: དགེ་སློང་དག་མཽད་གལ་གྱི་བུ་ཉིད་ཀྱིས་ལས་ཚོགས་རྙེད་པ། རྐྱེན་ཡོངས་སུ་བསྒྱུར་བ།
en: “Monks, Maudgalyāyana himself discovered the store of action, mastered conditions,

source: འོད་པ་བཞིན་དུ་ཉེ་བར་གནས་པ་གདོན་མི་ཟ་བར་འབྱུང་བར་འགྱུར་བ་དག་བྱས་ཤིང་བསགས་པས་
en: tended to them as one does an irrigation channel, and emerged without indecision.

source: མཽད་གལ་གྱི་བུ་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་བསགས་པ་དག་གཞན་སུ་ཞིག་གིས་སོ་སོར་མྱོང་བར་འགྱུར།
en: He himself acted and accumulated thus, so no one else experiences Maudgalyāyana’s actions and accumulations for themselves.

source: ལས་རྣམས་བསྐལ་པ་བརྒྱར་ཡང་ནི།
en: “Actions never waste away,

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ནས་ཧ་ཅང་ཐག་མི་རིང་བའི་བསྟི་གནས་ཤིག་ན་དྲང་སྲོང་བྱམས་པའི་བདག་ཉིད་ཅན།
en: “Monks, long ago, in a sanctuary not very far from the city of Vārāṇasī, there lived a sage who personified loving kindness.

source: སྙིང་རྗེ་དང་ལྡན་པ། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་ཞིག་འདུག་གོ། །
en: Endowed with compassion, he was kind to all sentient beings.

source: ཇི་ཙམ་ན་མི་དབུལ་པོ་ཞིག་ཤིང་ཁུར་ཐོགས་ཏེ་
en: One day, a poor man arrived at the sanctuary carrying a bundle of wood.

source: བསྟི་གནས་དེར་སོང་ནས་ཤིང་ཁུར་ཕོག་སྟེ་ངལ་སོ་ཞིང་འདུག་པ་དྲང་སྲོང་དེས་མཐོང་ནས།
en: The sage saw him put down his bundle of wood before sitting down to rest.

source: དེ་དེ་ལ་སྙིང་རྗེ་སྐྱེས་ཏེ་ཉོན་མོངས་པ་འདི་སྔོན་གྱི་ལས་ཀྱི་ཉེས་པས་མིར་སྐྱེས་ཀྱང་ཚེགས་ཆེན་པོས་འཚོ་བ་སྦྱོར་བར་བྱེད་ཀྱིས།
en: Feeling compassion for him, he thought, ‘He has been born a human, but because of faulty actions done in the past, this afflicted man must struggle very hard to make a living.

source: བདག་གིས་འདི་རབ་ཏུ་འབྱུང་ངོ་སྙམ་ནས་སྨྲས་པ། བུ་ཁྱོད་སུ་ཞིག་ཡིན།
en: I shall allow his going forth.’ “The sage called out, ‘Son, who are you?’

source: དེས་སྨྲས་པ། འཕགས་པ་བདག་ནི་མི་དབུལ་པོ་ཤིང་གིས་འཚོ་བ་སྦྱོར་བ་ཞིག་ལགས་སོ། །
en: ‘Noble one, I am a poor man who makes his living from wood.’
